This mostly looks fine to me; I've planned locally. The one thing that concerns me is replacing the ACM certificate, which is used by the live distribution – I don't know if anything will break if we try to replace a certificate that's in use.

Certificates are cheap/free, so rather than touching the existing cert, let's create a new cert that's just used with this distribution, rather than touching one that's already in use.

<details>
<summary>output of <code>terraform plan -no-color</code></summary>

```
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.cloudfront_core: Reading...
data.aws_iam_policy_document.lambda: Reading...
data.aws_iam_policy_document.lambda: Read complete after 0s [id=3454655979]
data.terraform_remote_state.cloudfront_core: Read complete after 2s
data.aws_route53_zone.zone: Reading...
data.aws_s3_bucket_object.dlcs_path_rewrite: Reading...
aws_iam_role.edge_lambda_role: Refreshing state... [id=edge_lambda20210115145807645600000001]
module.cert.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:760097843905:certificate/1a749ce8-ebd3-4342-accb-37f692fc8e52]
data.aws_route53_zone.zone: Read complete after 3s [id=Z0902614YH73JBCZG1MA]
module.cert.aws_route53_record.cert_validation["iiif-prod.wellcomecollection.org"]: Refreshing state... [id=Z0902614YH73JBCZG1MA__3de1ea364841b165a8f0f84c91d6d3aa.iiif-prod.wellcomecollection.org_CNAME]
module.cert.aws_route53_record.cert_validation["iiif-test.wellcomecollection.org"]: Refreshing state... [id=Z0902614YH73JBCZG1MA__abb9a4cf94db5c035d0b592c191a752c.iiif-test.wellcomecollection.org_CNAME]
module.cert.aws_route53_record.cert_validation["iiif-stage.wellcomecollection.org"]: Refreshing state... [id=Z0902614YH73JBCZG1MA__f6230f795c1f08b9a0b762a8453ded6a.iiif-stage.wellcomecollection.org_CNAME]
module.cert.aws_route53_record.cert_validation["iiif.wellcomecollection.org"]: Refreshing state... [id=Z0902614YH73JBCZG1MA__702dcdec0ef35b207c14c589bc694cef.iiif.wellcomecollection.org_CNAME]
aws_iam_role_policy_attachment.basic_execution_role: Refreshing state... [id=edge_lambda20210115145807645600000001-20210118123134169600000001]
data.aws_s3_bucket_object.dlcs_path_rewrite: Read complete after 2s [id=wellcomecollection-edge-lambdas/iiif/dlcs_path_rewrite.zip]
aws_lambda_function.dlcs_path_rewrite: Refreshing state... [id=cf_edge_dlcs_path_rewrite]
module.cert.aws_acm_certificate_validation.validation: Refreshing state... [id=2022-05-26 02:09:42.312 +0000 UTC]
module.iiif-test.aws_cloudfront_distribution.iiif: Refreshing state... [id=E2RTRZI6TQCGOR]
module.iiif-stage.aws_cloudfront_distribution.iiif: Refreshing state... [id=E1ADWCLNPHV609]
module.iiif-prod.aws_cloudfront_distribution.iiif: Refreshing state... [id=E1KKXGJWOADM2A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.cert.aws_acm_certificate.cert must be replaced
+/- resource "aws_acm_certificate" "cert" {
      ~ arn                       = "arn:aws:acm:us-east-1:760097843905:certificate/1a749ce8-ebd3-4342-accb-37f692fc8e52" -> (known after apply)
      ~ domain_validation_options = [
          - {
              - domain_name           = "iiif-prod.wellcomecollection.org"
              - resource_record_name  = "_3de1ea364841b165a8f0f84c91d6d3aa.iiif-prod.wellcomecollection.org."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_5b89b329a560128e050b56a978cb7b1f.jfrzftwwjs.acm-validations.aws."
            },
          - {
              - domain_name           = "iiif-stage.wellcomecollection.org"
              - resource_record_name  = "_f6230f795c1f08b9a0b762a8453ded6a.iiif-stage.wellcomecollection.org."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_419f0868883eeff2784ca33c2369ac3b.jfrzftwwjs.acm-validations.aws."
            },
          - {
              - domain_name           = "iiif-test.wellcomecollection.org"
              - resource_record_name  = "_abb9a4cf94db5c035d0b592c191a752c.iiif-test.wellcomecollection.org."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_23a25ae9e91f2a6b1d80a909bf1e0905.jfrzftwwjs.acm-validations.aws."
            },
          - {
              - domain_name           = "iiif.wellcomecollection.org"
              - resource_record_name  = "_702dcdec0ef35b207c14c589bc694cef.iiif.wellcomecollection.org."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_9d043bc38c49b91f4b8b48c5f02942c5.acm-validations.aws."
            },
            # (5 unchanged elements hidden)
        ]
      ~ id                        = "arn:aws:acm:us-east-1:760097843905:certificate/1a749ce8-ebd3-4342-accb-37f692fc8e52" -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "iiif-stage-new.wellcomecollection.org",
            # (3 unchanged elements hidden)
        ]
      - tags                      = {} -> null
      ~ validation_emails         = [] -> (known after apply)
        # (2 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.cert.aws_acm_certificate_validation.validation must be replaced
-/+ resource "aws_acm_certificate_validation" "validation" {
      ~ certificate_arn         = "arn:aws:acm:us-east-1:760097843905:certificate/1a749ce8-ebd3-4342-accb-37f692fc8e52" -> (known after apply) # forces replacement
      ~ id                      = "2022-05-26 02:09:42.312 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_3de1ea364841b165a8f0f84c91d6d3aa.iiif-prod.wellcomecollection.org",
          - "_702dcdec0ef35b207c14c589bc694cef.iiif.wellcomecollection.org",
          - "_abb9a4cf94db5c035d0b592c191a752c.iiif-test.wellcomecollection.org",
          - "_f6230f795c1f08b9a0b762a8453ded6a.iiif-stage.wellcomecollection.org",
        ] -> (known after apply) # forces replacement
    }

  # module.cert.aws_route53_record.cert_validation["iiif-prod.wellcomecollection.org"] must be replaced
-/+ resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "_3de1ea364841b165a8f0f84c91d6d3aa.iiif-prod.wellcomecollection.org" -> (known after apply)
      ~ id              = "Z0902614YH73JBCZG1MA__3de1ea364841b165a8f0f84c91d6d3aa.iiif-prod.wellcomecollection.org_CNAME" -> (known after apply)
      ~ name            = "_3de1ea364841b165a8f0f84c91d6d3aa.iiif-prod.wellcomecollection.org" -> (known after apply) # forces replacement
      ~ records         = [
          - "_5b89b329a560128e050b56a978cb7b1f.jfrzftwwjs.acm-validations.aws.",
        ] -> (known after apply)
      ~ type            = "CNAME" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.cert.aws_route53_record.cert_validation["iiif-stage-new.wellcomecollection.org"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = (known after apply)
      + zone_id         = "Z0902614YH73JBCZG1MA"
    }

  # module.cert.aws_route53_record.cert_validation["iiif-stage.wellcomecollection.org"] must be replaced
-/+ resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "_f6230f795c1f08b9a0b762a8453ded6a.iiif-stage.wellcomecollection.org" -> (known after apply)
      ~ id              = "Z0902614YH73JBCZG1MA__f6230f795c1f08b9a0b762a8453ded6a.iiif-stage.wellcomecollection.org_CNAME" -> (known after apply)
      ~ name            = "_f6230f795c1f08b9a0b762a8453ded6a.iiif-stage.wellcomecollection.org" -> (known after apply) # forces replacement
      ~ records         = [
          - "_419f0868883eeff2784ca33c2369ac3b.jfrzftwwjs.acm-validations.aws.",
        ] -> (known after apply)
      ~ type            = "CNAME" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.cert.aws_route53_record.cert_validation["iiif-test.wellcomecollection.org"] must be replaced
-/+ resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "_abb9a4cf94db5c035d0b592c191a752c.iiif-test.wellcomecollection.org" -> (known after apply)
      ~ id              = "Z0902614YH73JBCZG1MA__abb9a4cf94db5c035d0b592c191a752c.iiif-test.wellcomecollection.org_CNAME" -> (known after apply)
      ~ name            = "_abb9a4cf94db5c035d0b592c191a752c.iiif-test.wellcomecollection.org" -> (known after apply) # forces replacement
      ~ records         = [
          - "_23a25ae9e91f2a6b1d80a909bf1e0905.jfrzftwwjs.acm-validations.aws.",
        ] -> (known after apply)
      ~ type            = "CNAME" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.cert.aws_route53_record.cert_validation["iiif.wellcomecollection.org"] must be replaced
-/+ resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "_702dcdec0ef35b207c14c589bc694cef.iiif.wellcomecollection.org" -> (known after apply)
      ~ id              = "Z0902614YH73JBCZG1MA__702dcdec0ef35b207c14c589bc694cef.iiif.wellcomecollection.org_CNAME" -> (known after apply)
      ~ name            = "_702dcdec0ef35b207c14c589bc694cef.iiif.wellcomecollection.org" -> (known after apply) # forces replacement
      ~ records         = [
          - "_9d043bc38c49b91f4b8b48c5f02942c5.acm-validations.aws.",
        ] -> (known after apply)
      ~ type            = "CNAME" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.iiif-prod.aws_cloudfront_distribution.iiif will be updated in-place
  ~ resource "aws_cloudfront_distribution" "iiif" {
        id                             = "E1KKXGJWOADM2A"
        tags                           = {
            "Managed" = "terraform"
        }
        # (17 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:760097843905:certificate/1a749ce8-ebd3-4342-accb-37f692fc8e52" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (39 unchanged blocks hidden)
    }

  # module.iiif-stage.aws_cloudfront_distribution.iiif will be updated in-place
  ~ resource "aws_cloudfront_distribution" "iiif" {
        id                             = "E1ADWCLNPHV609"
        tags                           = {
            "Managed" = "terraform"
        }
        # (17 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:760097843905:certificate/1a749ce8-ebd3-4342-accb-37f692fc8e52" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (39 unchanged blocks hidden)
    }

  # module.iiif-stage-new.aws_cloudfront_distribution.iiif will be created
  + resource "aws_cloudfront_distribution" "iiif" {
      + aliases                        = [
          + "iiif-stage-new.wellcomecollection.org",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "IIIF APIs (stage-new)"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "Managed" = "terraform"
        }
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "iiif"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Origin",
                ]
              + query_string = true

              + cookies {
                  + forward = "all"
                }
            }
        }

      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "image/A00*"
          + target_origin_id       = "dlcs_wellcome_images"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Authorization",
                ]
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "image/B00*"
          + target_origin_id       = "dlcs_wellcome_images"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Authorization",
                ]
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "image/L00*"
          + target_origin_id       = "dlcs_wellcome_images"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Authorization",
                ]
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "image/M00*"
          + target_origin_id       = "dlcs_wellcome_images"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Authorization",
                ]
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "image/N00*"
          + target_origin_id       = "dlcs_wellcome_images"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Authorization",
                ]
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "image/S00*"
          + target_origin_id       = "dlcs_wellcome_images"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Authorization",
                ]
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "image/V00*"
          + target_origin_id       = "dlcs_wellcome_images"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Authorization",
                ]
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "image/W00*"
          + target_origin_id       = "dlcs_wellcome_images"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Authorization",
                ]
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 604800
          + path_pattern           = "image/*"
          + target_origin_id       = "dlcs_images"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Authorization",
                ]
              + query_string = true

              + cookies {
                  + forward = "all"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "thumbs/A00*"
          + target_origin_id       = "dlcs_wellcome_thumbs"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "thumbs/B00*"
          + target_origin_id       = "dlcs_wellcome_thumbs"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "thumbs/L00*"
          + target_origin_id       = "dlcs_wellcome_thumbs"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "thumbs/M00*"
          + target_origin_id       = "dlcs_wellcome_thumbs"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "thumbs/N00*"
          + target_origin_id       = "dlcs_wellcome_thumbs"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "thumbs/S00*"
          + target_origin_id       = "dlcs_wellcome_thumbs"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "thumbs/V00*"
          + target_origin_id       = "dlcs_wellcome_thumbs"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "thumbs/W00*"
          + target_origin_id       = "dlcs_wellcome_thumbs"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "thumb/*"
          + target_origin_id       = "iiif"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "*",
                ]
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "thumbs/*"
          + target_origin_id       = "dlcs_thumbs"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "av/*"
          + target_origin_id       = "dlcs_av"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "all"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "pdf/*"
          + target_origin_id       = "dlcs_pdf"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "all"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "file/*"
          + target_origin_id       = "dlcs_file"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "all"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "auth/*"
          + target_origin_id       = "dlcs_auth"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Authorization",
                ]
              + query_string = true

              + cookies {
                  + forward = "all"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23"
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "dash/*"
          + target_origin_id       = "dashboard"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "*",
                ]
              + query_string = true

              + cookies {
                  + forward = "all"
                }
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "pdf-cover/*"
          + target_origin_id       = "pdf_cover"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }
        }

      + origin {
          + domain_name = "dlcs.io"
          + origin_id   = "dlcs_auth"
          + origin_path = "/auth/2"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif-stage-new.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "dlcs.io"
          + origin_id   = "dlcs_av"
          + origin_path = "/iiif-av/wellcome/6"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif-stage-new.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "dlcs.io"
          + origin_id   = "dlcs_images"
          + origin_path = "/iiif-img/wellcome/6"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif-stage-new.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "dlcs.io"
          + origin_id   = "dlcs_thumbs"
          + origin_path = "/thumbs/wellcome/6"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif-stage-new.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "dlcs.io"
          + origin_id   = "dlcs_wellcome_images"
          + origin_path = "/iiif-img/wellcome/8"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif-stage-new.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "dlcs.io"
          + origin_id   = "dlcs_wellcome_thumbs"
          + origin_path = "/thumbs/wellcome/8"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif-stage-new.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "dash-test.wellcomecollection.digirati.io"
          + origin_id   = "dashboard"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "dds-test.wellcomecollection.digirati.io"
          + origin_id   = "iiif"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "dlcs.io"
          + origin_id   = "dlcs"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "dlcs.io"
          + origin_id   = "dlcs_file"
          + origin_path = "/file/wellcome/6"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "dlcs.io"
          + origin_id   = "dlcs_pdf"
          + origin_path = "/pdf/wellcome/pdf/6"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "pdf-stage.wellcomecollection.digirati.io"
          + origin_id   = "pdf_cover"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.iiif-test.aws_cloudfront_distribution.iiif will be updated in-place
  ~ resource "aws_cloudfront_distribution" "iiif" {
        id                             = "E2RTRZI6TQCGOR"
        tags                           = {
            "Managed" = "terraform"
        }
        # (17 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:760097843905:certificate/1a749ce8-ebd3-4342-accb-37f692fc8e52" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (39 unchanged blocks hidden)
    }

Plan: 8 to add, 3 to change, 6 to destroy.

Changes to Outputs:
  + iiif_stage_new_distribution_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: terraform.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.plan"
```

</summary>